InformationRegisters/АнализДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>АнализДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Компьютеры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Коментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СязанныйДокумент</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДисконтнаяКарта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнформационныеКарты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействиеНадЗаказами</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/НомерОперацииАнализаДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<InformationRegister>
		<Properties>
			<Name>НомерОперацииАнализаДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АнализДействий/Ext/ManagerModule.bsl
Процедура СоздатьЗаписьВРегистреАнализДействий(Ссылка, СтруктураДействий )  Экспорт          
	
	АнализДействий  = РегистрыСведений.АнализДействий.СоздатьМенеджерЗаписи();	
	АнализДействий.Дата	= ТекущаяДата();
	АнализДействий.Пользователь = глЗначениеПеременной("глТекущийПользователь");
	АнализДействий.Действие = СтруктураДействий["Действие"];
	АнализДействий.Заказ = Ссылка; 
	АнализДействий.Компьютер  = ПараметрыСеанса.ТекущийКомпьютер; //ПолучитьСерверТО().ПолучитьКомпьютерТО();
	АнализДействий.Изменение =  СтруктураДействий["ЧтоИзменялось"];
	АнализДействий.Количество = СтруктураДействий["Количество"];  
	АнализДействий.Коментарий = СтруктураДействий["Коментарий"];
	
	//Костенюк Александр-Старт 29.03.2012
	Если НЕ Ссылка.Пустая() Тогда
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("ДисконтнаяКарта", Ссылка.ПолучитьОбъект().Метаданные()) Тогда
			АнализДействий.ДисконтнаяКарта = Ссылка.ДисконтнаяКарта; 
		КонецЕсли;
	КонецЕсли;
	//Костенюк Александр-Финиш 29.03.2012
	
	Попытка
		АнализДействий.Записать(); 
	Исключение
		ОбщегоНазначения.СообщитьОбОшибкеЗапеисиРегистра(ОписаниеОшибки(), , ,,);
	КонецПопытки;
	
КонецПроцедуры

// Чистяков Павел 01.03.2012 13:50:52 
Процедура Зарегистрировать(Действие,Заказ,Изменение=Неопределено,Комментарий="",Количество=0,СвязанныйДокумент=Неопределено) Экспорт
	
	АнализДействий  			= РегистрыСведений.АнализДействий.СоздатьМенеджерЗаписи();	
	
	//Костенюк Александр-Закомментировано 14.05.2013
	// такой механизм неоптимален
	//Запрос = Новый Запрос(
	//"ВЫБРАТЬ ПЕРВЫЕ 1
	//|	МАКСИМУМ(АнализДействий.Ключ) КАК Ключ
	//|ИЗ
	//|	РегистрСведений.АнализДействий КАК АнализДействий"
	//);
	//Выборка = Запрос.Выполнить().Выбрать();
	//Если Выборка.Следующий() Тогда
	//	Если Выборка.Ключ<>Неопределено
	//		И Выборка.Ключ<>null Тогда
	//		АнализДействий.Ключ	= Выборка.Ключ+1;
	//	КонецЕсли; 
	//КонецЕсли; 
	
	//Костенюк Александр-Старт 14.05.2013
	НомерОперации = РегистрыСведений.НомерОперацииАнализаДействий.ПолучитьНомерОперации();
	// Если еще нет записей в регистре НомерОперацииАнализаДействий, то используем старый алгоритм
	// т.е. получаем максимальное значение из регистра "АнализДействий"
	Если НомерОперации = 0 Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	МАКСИМУМ(АнализДействий.Ключ) КАК Ключ
		|ИЗ
		|	РегистрСведений.АнализДействий КАК АнализДействий"
		);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Ключ<>Неопределено
				И Выборка.Ключ<>null Тогда
				НомерОперации = Выборка.Ключ; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли;
	АнализДействий.Ключ = НомерОперации + 1;
	//Костенюк Александр-Финиш 14.05.2013
	
	АнализДействий.Дата			= ТекущаяДата();
	АнализДействий.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	АнализДействий.Действие		= Действие;
	АнализДействий.Заказ		= Заказ; 
	АнализДействий.Компьютер	= ПараметрыСеанса.ТекущийКомпьютер;
	АнализДействий.Изменение	= Изменение;
	АнализДействий.Количество	= Количество;
	АнализДействий.Коментарий	= Комментарий;
	АнализДействий.СязанныйДокумент = СвязанныйДокумент;
	
	//Костенюк Александр-Старт 29.03.2012
	Если НЕ Заказ.Пустая() Тогда
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("ДисконтнаяКарта", Заказ.ПолучитьОбъект().Метаданные()) Тогда
			АнализДействий.ДисконтнаяКарта = Заказ.ДисконтнаяКарта; 
		КонецЕсли;
	КонецЕсли;
	//Костенюк Александр-Финиш 29.03.2012

	АнализДействий.Записать();
	РегистрыСведений.НомерОперацииАнализаДействий.ЗаписатьНомерОперации(АнализДействий.Ключ); //Костенюк Александр 14.05.2013
	
КонецПроцедуры
